
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
// Получаем текущую строку табличной части, в которой находится курсор
	ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	// Заполняем сумму по формуле
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	// Вызываем уже готовый расчет из предыдущей процедуры
	СписокНоменклатурыКоличествоПриИзменении(Элемент);
КонецПроцедуры
