        Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Включаем запись движений по нашему регистру
	Движения.ОстаткиНоменклатуры.Записывать = Истина;  
	
	Движения.ЖурналПроводок.Записывать = Истина; // <-- ДОБАВИТЬ ЭТУ СТРОКУ
	
	Для Каждого ТекСтрока Из СписокНоменклатуры Цикл
		
		// На экзамене 1С важно проверять тип номенклатуры. 
		// Услуги на складе не хранятся, по ним движения делать нельзя.
		Если ТекСтрока.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавляем запись в регистр с типом "Приход"
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
		
		// Заполняем обязательные свойства каждой записи
		Движение.Период      = Дата;
		Движение.Склад       = Склад;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Партия      = Ссылка; // Текущий документ является партией поступления
		
		// Заполняем ресурсы
		Движение.Количество  = ТекСтрока.Количество;
		Движение.Стоимость   = ТекСтрока.Сумма;    
		
		// -------------------------------------------------------------
		// ДОБАВЛЯЕМ: Формирование бухгалтерской проводки
		// -------------------------------------------------------------
		Проводка = Движения.ЖурналПроводок.Добавить();
		Проводка.Период = Дата;
		
		// Задаем корреспондирующие счета
		Проводка.СчетДт = ПланыСчетов.Основной.НайтиПоКоду("41"); // Куда пришел товар
		Проводка.СчетКт = ПланыСчетов.Основной.НайтиПоКоду("60"); // От кого (наш долг)
		
		// Заполняем балансовый ресурс (деньги)
		Проводка.Сумма  = ТекСтрока.Сумма;
		
		// Заполняем количественный учет по Дебету
		// Так как на счете 41 стоит признак "Количественный", платформа запишет штуки
		Проводка.КоличествоДт = ТекСтрока.Количество;

		
	КонецЦикла;

КонецПроцедуры
