        Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Включаем запись движений по нашему регистру
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Для Каждого ТекСтрока Из СписокНоменклатуры Цикл
		
		// На экзамене 1С важно проверять тип номенклатуры. 
		// Услуги на складе не хранятся, по ним движения делать нельзя.
		Если ТекСтрока.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавляем запись в регистр с типом "Приход"
		Движение = Движения.ОстаткиНоменклатуры.ДобавитьПриход();
		
		// Заполняем обязательные свойства каждой записи
		Движение.Период      = Дата;
		Движение.Склад       = Склад;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.Партия      = Ссылка; // Текущий документ является партией поступления
		
		// Заполняем ресурсы
		Движение.Количество  = ТекСтрока.Количество;
		Движение.Стоимость   = ТекСтрока.Сумма;
		
	КонецЦикла;

КонецПроцедуры
